
`use strict`;





// todo Напиши скрипт, який для об’єкта user послідовно:
//  - додасть поле mood зі значенням ‘happy’
//  - замінить hobby на ‘skydiving’
//  - замінить значення premium на false
//  - виводить вміст об’єкта user у форматі ключ:значення,
// використовуючи Object.keys() і for...of
// const user = {
//     name: ‘John’,
//     age: 20,
//     hobby: ‘tennis’,
//     premium: true,
//    }
//    ___________________________________________________
   // todo У нас є об‘єкт, у якому зберігаються заробітні плати команди.
   // Напишіть код для отримання суми усіх зарплат і збережіть його результат у змінній sum
   // Якщо об‘єкт salaries порожній, то результат повинен бути 0
//    const salaries = {
//     Mango: 100,
//     Poly: 160,
//     Ajax: 1470,
//    }
//    ___________________________________________________
   // todo Напишіть функцію calcTotalPrice(stones, stonesName), яка приймає масив об‘єктів та рядок із назвою каменя.
   // Функція рахує і повертає загальну вартість каменів з таким іменем, ціною та кількістю з об‘єкта
//    const stonesArray = [
//     { name: ‘Ізумруд‘, price: 1300, quantity: 4 },
//     { name: ‘Брилліант‘, price: 2700, quantity: 6 },
//     { name: ‘Сапфір‘, price: 400, quantity: 7 },
//     { name: ‘Щебінь‘, price: 150, quantity: 100 },
//    ]
//    ____________________________________________________
   // todo Напишіть функцію updateObject, яка приймає об‘єкт і повертає новий об’єкт без вказаних параметрів
   // Результат, що очікується ({a: 1, b: 2, c: 3}, ‘b’, ‘a’) => {c: 3}
//    ____________________________________________________
   // Напишіть функцію, яка очистить масив від небажаних значень, таких як false, undefined, порожні рядки, нуль, null
   // Результат, що очікується[0, 1, false, 2, undefined, ‘’, 3, null] => [1, 2, 3]
//    ____________________________________________________
//    const arrNumber = [4, 5, 3, 1, 2]
   // Напишіть функцію, яка розвертає масив у зворотньому напрямку.Метод reverse() не використовувати
//    ____________________________________________________
//    Напишіть функцію, яка повертає новий масив без вказаних значень.Використовуйте примітиви
   // Очікується [1, 2, 3, 1, 2] без [1, 2] => [1,2,3]
//    ____________________________________________________
   // Напишіть фукнцію, яка порівнює два масиви і повертає true, якщо вони ідентичні
   // Очікується([1, 2, 3], [1, 2, 3]) => true
   // Очікується([4, 5, 5], [1, 2, 3]) => false
   // Очікується([4, 5, 5,6,7], [1, 2, 3]) => false
//    ____________________________________________________
   // Напишіть функцію, яка перетворює глибокий масив в одномірний. Не використовувати array.flat()
   // Очікується[1, 2, [3, 4, [5]]] => [1, 2, 3, 4, 5]